Revit 2022 API
FabricationService Properties
The FabricationService type exposes the following members.
Properties
Name | Description
Abbreviation
 The short name of service.
FabricationSystemName
 The fabrication system name of the service.
GroupCount |  Obsolete.
 This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the `PaletteCount` property instead.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The name of the service.
PaletteCount
 The number of palettes in the service.
ServiceId
 The service identifier of the service.
See Also
FabricationService Class
Autodesk.Revit.DB Namespace